wayne-love/sn_esp32/src/main.cpp
  switchADPublish(mqttClient, spa, "Aux Heat Element", "{{ value_json.heatpump.auxheat }}", "heatpump_auxheat");

  std::vector<String> colorModeStrings(std::begin(si.colorModeStrings), std::end(si.colorModeStrings));
  lightADPublish(mqttClient, spa, "Lights", "{{ value_json.lights }}", "lights", "", "", colorModeStrings);
  selectADPublish(mqttClient, spa, "Lights Speed","{{ value_json.lights.speed }}","lights_speed", "", "", {"1","2","3","4","5"});

  std::vector<String> sleepStrings;
  for (const auto& pair : si.sleepMap) {
      sleepStrings.push_back(pair.first);
  }
  selectADPublish(mqttClient, spa, "Sleep Timer 1","{{ value_json.sleepTimers.timer1.state }}", "sleepTimers_1_state", "config", "", sleepStrings);
  selectADPublish(mqttClient, spa, "Sleep Timer 2","{{ value_json.sleepTimers.timer2.state }}", "sleepTimers_2_state", "config", "", sleepStrings);

  TextAdConfig textConfig;

  textConfig.displayName = "Date Time";
  textConfig.valueTemplate = "{{ value_json.status.datetime }}";
  textConfig.propertyId = "status_datetime";
  textConfig.entityCategory = "config";
  textConfig.regex = "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}";
  generateAdJSON(output, textConfig, spa, discoveryTopic, "text");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  textConfig.displayName = "Sleep Timer 1 Begin";
  textConfig.valueTemplate = "{{ value_json.sleepTimers.timer1.begin }}";
  textConfig.propertyId = "sleepTimers_1_begin";
  textConfig.entityCategory = "config";
  textConfig.regex = "[0-2][0-9]:[0-9]{2}";
  generateAdJSON(output, textConfig, spa, discoveryTopic, "text");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  textConfig.displayName = "Sleep Timer 1 End";
  textConfig.valueTemplate = "{{ value_json.sleepTimers.timer1.end }}";
  textConfig.propertyId = "sleepTimers_1_end";
  textConfig.entityCategory = "config";
  textConfig.regex = "[0-2][0-9]:[0-9]{2}";
  generateAdJSON(output, textConfig, spa, discoveryTopic, "text");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  textConfig.displayName = "Sleep Timer 2 Begin";
  textConfig.valueTemplate = "{{ value_json.sleepTimers.timer2.begin }}";
  textConfig.propertyId = "sleepTimers_2_begin";
  textConfig.entityCategory = "config";
  textConfig.regex = "[0-2][0-9]:[0-9]{2}";
  generateAdJSON(output, textConfig, spa, discoveryTopic, "text");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  textConfig.displayName = "Sleep Timer 2 End";
  textConfig.valueTemplate = "{{ value_json.sleepTimers.timer2.end }}";
  textConfig.propertyId = "sleepTimers_2_end";
  textConfig.entityCategory = "config";
  textConfig.regex = "[0-2][0-9]:[0-9]{2}";
  generateAdJSON(output, textConfig, spa, discoveryTopic, "text");
  mqttClient.publish(discoveryTopic.c_str(), output.c_str(), true);

  fanADPublish(mqttClient, spa, "Blower", "{{ value_json.blower }}", "blower");

  std::vector<String> spaModeStrings(std::begin(si.spaModeStrings), std::end(si.spaModeStrings));
  selectADPublish(mqttClient, spa, "Spa Mode", "{{ value_json.status.spaMode }}", "status_spaMode", "", "", spaModeStrings);

}

#pragma region MQTT Publish / Subscribe

void mqttPublishStatusString(String s){

  mqttClient.publish(String(mqttBase+"rfResponse").c_str(),s.c_str());

}

void mqttPublishStatus() {
  String json;
  if (generateStatusJson(si, json)) {
    mqttClient.publish(mqttStatusTopic.c_str(),json.c_str());
  } else {
    debugD("Error generating json");
  }
}


void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String t = String(topic);

  String p = "";
  for (uint x = 0; x < length; x++) {
    p += char(*payload);
    payload++;
  }

  debugD("MQTT subscribe received '%s' with payload '%s'",topic,p.c_str());

  String property = t.substring(t.lastIndexOf("/")+1);

  debugI("Received update for %s to %s",property.c_str(),p.c_str());

  if (property == "temperatures_setPoint") {
    si.setSTMP(int(p.toFloat()*10));
  } else if (property == "heatpump_mode") {
    si.setHPMP(p);
  } else if (property == "pump1") {
    si.setRB_TP_Pump1(p=="OFF"?0:1);
  } else if (property == "pump2") {
    si.setRB_TP_Pump2(p=="OFF"?0:1);
  } else if (property == "pump3") {
    si.setRB_TP_Pump3(p=="OFF"?0:1);
  } else if (property == "pump4") {
    si.setRB_TP_Pump4(p=="OFF"?0:1);
  } else if (property == "pump5") {
    si.setRB_TP_Pump5(p=="OFF"?0:1);
  } else if (property == "heatpump_auxheat") {
    si.setHELE(p=="OFF"?0:1);
  } else if (property == "status_datetime") {
    tmElements_t tm;
    tm.Year=CalendarYrToTm(p.substring(0,4).toInt());
    tm.Month=p.substring(5,7).toInt();
    tm.Day=p.substring(8,10).toInt();
    tm.Hour=p.substring(11,13).toInt();
    tm.Minute=p.substring(14,16).toInt();
    tm.Second=p.substring(17).toInt();
    si.setSpaTime(makeTime(tm));
  } else if (property == "lights_state") {
    si.setRB_TP_Light(p=="ON"?1:0);
  } else if (property == "lights_effect") {
    si.setColorMode(p);
  } else if (property == "lights_brightness") {
    si.setLBRTValue(p.toInt());
  } else if (property == "lights_color") {
    int pos = p.indexOf(',');
    if ( pos > 0) {
      int value = p.substring(0, pos).toInt();
      si.setCurrClr(si.colorMap[value/15]);
    }
  } else if (property == "lights_speed") {
    si.setLSPDValue(p);
  } else if (property == "blower_state") {
    si.setOutlet_Blower(p=="OFF"?2:0);
  } else if (property == "blower_speed") {
    if (p=="0") si.setOutlet_Blower(2);
    else si.setVARIValue(p.toInt());
  } else if (property == "blower_mode") {
    si.setOutlet_Blower(p=="Variable"?0:1);
  } else if (property == "sleepTimers_1_state" || property == "sleepTimers_2_state") {
    for (const auto& pair : si.sleepMap) {
      if (pair.first == p) {
        if (property == "sleepTimers_1_state")
          si.setL_1SNZ_DAY(pair.second);
        else if (property == "sleepTimers_2_state")
          si.setL_2SNZ_DAY(pair.second);
        break;
      }
    }
  } else if (property == "sleepTimers_1_begin") {
    si.setL_1SNZ_BGN(convertToInteger(p));
  } else if (property == "sleepTimers_1_end") {
    si.setL_1SNZ_END(convertToInteger(p));
  } else if (property == "sleepTimers_2_begin") {
    si.setL_2SNZ_BGN(convertToInteger(p));
  } else if (property == "sleepTimers_2_end") {
    si.setL_2SNZ_END(convertToInteger(p));
  } else if (property == "status_spaMode") {
    si.setMode(p);
  } else {
    debugE("Unhandled property - %s",property.c_str());
  }
}


#pragma endregion

void setup() {
  #if defined(EN_PIN)
    pinMode(EN_PIN, INPUT_PULLUP);
  #endif

  #if !defined(ESP8266) or defined(ENABLE_SERIAL)
    Serial.begin(115200);
    Serial.setDebugOutput(true);
    Debug.setSerialEnabled(true);
  #endif

